<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<details open><summary>Diff of 3 changes.</summary>

```diff
+ tailscale_tailnet_key.tailscale_key will be created
+ terraform_data.tskey_replacement_hook will be created
! module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 1 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-17T00:11:13Z [(view log)](https://github.com/perchnet/p/actions/runs/17014410720/job/48234663894#step:11:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = true
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # terraform_data.tskey_replacement_hook will be created
  + resource "terraform_data" "tskey_replacement_hook" {
      + id     = (known after apply)
      + input  = [
          + "2025-08-16T22:58:41Z",
        ]
      + output = (known after apply)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_vm.vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "vm" {
        id                      = "134"
        name                    = "vm-debian13-minimal"
        tags                    = [
            "terraform",
        ]
        # (29 unchanged attributes hidden)

      ~ disk {
          ~ interface         = "scsi1" -> "scsi0"
          ~ size              = 11 -> 10
            # (13 unchanged attributes hidden)
        }
      ~ disk {
          ~ interface         = "scsi0" -> "scsi1"
            # (14 unchanged attributes hidden)
        }

        # (9 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-63-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->